english/动名词.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2023-03-10 Fri 22:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>动名词</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">动名词</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc8929bc">1. 动名词基础形式： verb + ing</a>
<ul>
<li><a href="#orgea2c4f0">1.1. 语态</a></li>
<li><a href="#org3a913c5">1.2. 时态</a></li>
</ul>
</li>
<li><a href="#orgfe7f40f">2. 动名词的用法</a>
<ul>
<li><a href="#org68efeda">2.1. 主语： 表示抽象的、习惯性的动作或泛指某种动作;不定式做主语一般表示具体某次动作或者即将发生的动作</a></li>
<li><a href="#org9bfe1d2">2.2. 表语： 仅限表示工作、任务等抽象名词，表示主语的内涵（类比同位语从句）</a></li>
<li><a href="#org0b6aafd">2.3. 宾语</a></li>
<li><a href="#org03dc0b9">2.4. 定语： 常位于被修饰名词前，充当前置修饰语</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc8929bc" class="outline-2">
<h2 id="orgc8929bc"><span class="section-number-2">1.</span> 动名词基础形式： verb + ing</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgea2c4f0" class="outline-3">
<h3 id="orgea2c4f0"><span class="section-number-3">1.1.</span> 语态</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">&#34920;1&nbsp;</span> 动名词时态及语态</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">形式</th>
<th scope="col" class="org-left">主动</th>
<th scope="col" class="org-left">被动</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">一般式</td>
<td class="org-left">doing</td>
<td class="org-left">being done</td>
</tr>

<tr>
<td class="org-left">完成式</td>
<td class="org-left">having done</td>
<td class="org-left">having been done</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org3a913c5" class="outline-3">
<h3 id="org3a913c5"><span class="section-number-3">1.2.</span> 时态</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>一般式<br />
当动名词的动作没有明确表示与谓语动词是同时发生还是在谓语动词前发生<br />
e.g  I am only intersted in sitting in a boat and doing nothing at all.<br />
     I am proud of being a member of the school team.</li>
<li>完成式<br />
当动名词的动作发生在谓语动词前，主要用于宾语<br />
固定搭配 be sorry for having done sth.<br />
e.g  I'm sorry for having broken the window. 打破窗户在我道歉之前</li>
<li>对于发生在谓语动词前却要使用一般式的特殊情况<br />
e.g On hearing the bad news, she couldn't help crying.<br />
    I shall never forget seeing the Great Wall for the first time.<br /></li>
</ol>
<ul class="org-ul">
<li>语态
<ol class="org-ol">
<li><b>主动表被动</b><br />
e.g The house requires/needs/wants repairing. 这个房子需要被修理。 在require/need/want 这类表需要的词后面主动表示被动。<br />
    The book is well worth reading. 这本书很值得 <b>被读</b><br />
    Is that museum worth visiting? 那个博物馆值得被参观吗?<br /></li>
</ol></li>
</ul>
<hr />
</div>
</div>
</div>
<div id="outline-container-orgfe7f40f" class="outline-2">
<h2 id="orgfe7f40f"><span class="section-number-2">2.</span> 动名词的用法</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org68efeda" class="outline-3">
<h3 id="org68efeda"><span class="section-number-3">2.1.</span> 主语： 表示抽象的、习惯性的动作或泛指某种动作;不定式做主语一般表示具体某次动作或者即将发生的动作</h3>
<div class="outline-text-3" id="text-2-1">
<p>
e.g Doing exercises does us a lot of good.
</p>
<ul class="org-ul">
<li>注意
<ol class="org-ol">
<li>动名词做主语时谓语动词常用单数</li>
<li>表示不同概念的动名词通过and连用时谓语动词用复数形式</li>
<li>动名词做主语时常用“it”做形式主语或"there is no"结构
There is no + doing 根本不可能<br />
There is no point/not much point (in) doing 做xxx没有意义</li>
</ol></li>
<li>错题
<ul class="org-ul">
<li><span class="underline">Losing</span> in the forest can be a terrifying experience. <b>Being lost</b></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9bfe1d2" class="outline-3">
<h3 id="org9bfe1d2"><span class="section-number-3">2.2.</span> 表语： 仅限表示工作、任务等抽象名词，表示主语的内涵（类比同位语从句）</h3>
<div class="outline-text-3" id="text-2-2">
<p>
e.g Her job is teaching.<br />
    Talking to him is talking to a wall.
</p>
</div>
</div>
<div id="outline-container-org0b6aafd" class="outline-3">
<h3 id="org0b6aafd"><span class="section-number-3">2.3.</span> 宾语</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><ol class="org-ol">
<li><b>表示一般的、抽象的、经常性的行为</b><br />
e.g I couldn't risk missing that train.<br /></li>
<li>下列动词后接动词作宾语时必须用动名词形式<br />
<ol class="org-ol">
<li>admit advise allow anticipate期望 appreciate avoid ban consider delay confess deny detest厌恶 dislike encourage enjoy ensure escape excuse原谅 face fancy想象 finish forbid forgive<br />
imagine involve涉及 include keep mention mind miss omit省略 pardon宽恕 permit postphone推迟 practise prevent quit recall记起 report resist抵抗 risk recommend resent愤恨 save suggest tolerate忍受</li>
<li>feel like</li>
<li>can't help doing 忍不住 can't help to do 不能帮助做某事</li>
<li>can't resist = can't help doing 忍不住</li>
<li>give up</li>
<li>put off = postphone推迟</li>
</ol></li>
<li>下列动词后接动词作宾语时用动名词形式，但如果后面有名词或代词作为宾语，用不动式做宾语补足语<br />
allow,advise,encourage,forbid(forbade,forbi <b>dd</b> en),permit,recommend<br />
e.g We don't allow smoking here./We don't allow customers to smoke here.<br />
曾错点: image doing sth/image sb. doing sth.</li>
<li>动词need,requires,want,demand 作“需要”这类表需要的词以及deserve作“应得”的意思后面主动表示被动，含义与不定式相同<br />
e.g The window needs cleaning./The window needs to be cleaned.<br />
    The child deserves praising./The child deserves to be praised.</li>
<li>excuse,forgive,pardon 两种形式
e.g Excuse forgive my opening your letter by mistake.<br />
    Excuse forgive me for opening your letter by mistake.</li>
<li>某些动词短语中to是介词，后跟动名词，不用不定式<br />
be accustomed to; be devoted to ; be familiar to ; be opposed to 反对; be related to;<br />
be subjected to 遭受到; admit to ; amount to; come to ; devote oneself to; get down to;<br />
give one's mind to 专心于; in addition to; look up to; look forward to ; object to ; respond to ; stand up to ; say yes/no to ; <br />
turn to ; be committed to; be equal to ; be open to ; be reduced to; be sentenced to; <br />
<b>be used to doing 习惯于(used to do 过去常常做 be used to do 被用来做 )</b> ;add to ; apply oneself to;<br />
confess (to) ; find one's way to ; give way to ; give rise to; keep to; lead to; next to ; pay attention to ; stick to ; see to ; trust to ; <br />
make a contribution to</li>
<li>某些词后不定式与动名词含义有差别<br />
e.g forget/remember/regret to do 去做<br />
    forget/remember/regret doing 做过</li>
<li>许多介词与不定式可以构成状语，表示时间、原因、方式等<br />
e.g She was praised <b>for doing her homework well.</b><br />
    <b>Before sending a letter</b>, you must put a stamp on the envelope.</li>
<li>作形容词worth,busy这种具有状语性质的宾语后跟动名词<br />
e.g He was worth teaching.<br />
    He was busy studying.</li>
<li>错题
<ol class="org-ol">
<li>Our purpose in life is <span class="underline">serving</span> the people. <b>to serve</b><br /></li>
<li>Another bridge is <span class="underline">being built</span> across the river next year. <b>to be built</b><br /></li>
<li>I have just moved into a new apartment and I have been trying <span class="underline">getting</span> my new rooms in order. <b>to get</b><br /></li>
<li>I'm terribly sorry for <span class="underline">giving</span> you so much trouble. <b>having given</b> <b>参见2.2</b></li>
</ol></li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org03dc0b9" class="outline-3">
<h3 id="org03dc0b9"><span class="section-number-3">2.4.</span> 定语： 常位于被修饰名词前，充当前置修饰语</h3>
<div class="outline-text-3" id="text-2-4">
<p>
e.g a writting desk ; a smoking room; a swimming pool
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-03-10 Fri 22:41</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
